{
  "name": "DR. ADEOLA ADEJOKE PHILLIPS",
  "position": "The Chairman",
  "details": [
    "Olufemi Bakre is a visionary leader with over 32 years of banking experience that cuts across the Multilateral Business, Foreign and Local Financial Institutions, Public Sector, Corporate & Retail Banking and Customer Relationship Management. ",
    "He commenced his banking career at MBC International bank (formerly Merchant Banking Corporation) where he rose to the position of a General Manager. After the acquisition of MBC by First Bank in 2006, he became the Group Head, Multilateral, Financial Institutions and Global Custody. He initiated and delivered the First Bank China Representative Office, amongst others.",
    "Olufemi joined First City Monument Bank in 2011 and held various positions. In 2015, he was appointed as the Executive Director of Corporate & Institutional Banking in the United Kingdom and Nigeria; the position he held till March 2020.",
    "He was appointed the Managing Director of Parallex Bank Limited in January 2021, the position he occupies till date.",
    "He has bagged more than 36 professional certifications in addition to some degree awards. He holds the Bachelor and Masters’ degrees in Banking & Finance from the prestigious University of Lagos, Nigeria. He is an Honorary Senior Member (HSM) of the Chartered Institute of Bankers of Nigeria. He is also a Strategy and Advocacy Committee member of the institute. He is a fellow and member of some associations like Chartered Institute of Securities & Investment (MCISI) United Kingdom, Corporate Governance & Strategic Operations Management, Institute of Government Research & Leadership Technology, Institute of Data Processing Management of Nigeria, Direct Marketing Association of Nigeria, Nigeria Institute of Management and Bank Director Association of Nigeria.",
    "Olufemi has attended several executive management programs both locally and offshore and that includes Strategic Thinking and Organizational Effectiveness, Innovate UK, Senior Management Development Program at Surrey, Leadership program at London Business School, Enterprise Risk Management Training, Credit Concepts and Management Programme, AML workshop and Customer due diligence for Relationship Managers UK. BP & E Global CPD UK, Enterprise Risk Management and Credit Risk & Financial Analysis et cetera.",
    "He has a natural drive for excellence. He is purposeful, focused, self-driven and very proactive in handling issues. His amiable character, excellent inter-personal relationship, coaching and people management skills make him very approachable. Amongst other responsibilities, he provides strategic advice and guidance towards meeting the vision of Parallex Bank Limited. His role is to preserve and grow the assets of the bank and as well increase the shareholder’s value with a strong focus on corporate governance."
  ]
}
