{
  "name": "CHIKA IDIGO",
  "position": "Head, Legal Services",
  "src": "/images/BOD/avi.png",
  "details": [
    "Chika is a distinguished corporate and commercial law expert. In 2017, Chika was appointed the Company Secretary and Legal Adviser of Specialized Resolution Company (ESRC) Ltd, a financial asset management firm and subsidiary of Ecobank Transnational Incorporated (ETI). With a rare touch of uncommon dedication and passion, she anchored both the Board and Company Secretarial as well as the Legal Advisory roles and responsibilities of the start-up firm leaving behind enviable and indelible records of high performance, goal achievement and corporate excellence.",
    "Chika graduated with LL.B (Hons) degree from Nnamdi Azikiwe University Awka, Nigeria, emerging as the best graduating student of her class in 2002. She obtained B.L from Nigerian Law School in 2004 and thereafter, obtained LL.M degree from the University of Lagos in 2008. She has several qualifications and certifications of the following professional bodies: Negotiation & Conflict Management Group (NCMG); Chartered Institute of Arbitrators UK (Nigerian Branch); Institute of Chartered Secretaries & Administrators of Nigeria (ICSAN); and Business Recovery & Insolvency Practitioners of Nigeria (BRIPAN). She is also a member of Nigeria Bar Association (NBA).",
    "Chika is a superlative performer, diligent legal professional and corporate team player. She was honored among the 'Rising Stars 40 under 40 Category' of the 2016 Nigerian Legal Awards - an award given to recognize and encourage 40 Nigerian Lawyers under the age of 40 across various industries, who are evaluated as having demonstrated the ability to shape the future of the legal profession in Nigeria",
    "She joined the Legal and Regulatory Department of Ecobank Nigeria in 2006 after a brief stint in private Law practice. With a strong knack for versatility and professionalism, she handled legal reviews of corporate and commercial credit transactions and complex commercial documentation before moving over to manage the llitigation portfolio of the bank where she played key roles in reducing the mounting litigation cases arising from the several acquisitions of other lending institutions by the bank. She also played active roles in debt recovery activities of the bank when she was seconded to the Early Warning, Remedial & Loan Recovery Department where she initiated legal templates to advance recovery of challenged risk assets through legal processes."
  ]
}
