{
  "name": "WASIU POPOOLA",
  "position": "Head, Digital and Innovation",
  "src": "/images/BOD/avi.png",
  "details": [
    "Wasiu Popoola is a seasoned Digital transformation and Fintech professional with over 16 years of digital banking experience. Prior to his appointment, he has served in various key capacities within the Digital and Electronic Banking units of various banks.  Some of his previous positions include, Group Head of Proposition and Partnership at Sterling Bank, Head of Electronic Banking Channels at Unity bank, Product Manager for FlashmeCash at FCMB, Team Lead Channel Support and Corporate Solution at FinBank, ePayment Specialist and MIS Officer at Access Bank, and Technical Support Officer for Cards and Channels at First Bank.",
    "Wasiu obtained Certificate in Digital Transformation covering AI, IoT, Cloud, Blockchain and Cybersecurity from the prestigious MIT in 2021. He holds a Bachelor of Science in Computer Science from University of Ilorin. He later attended University of Lagos to obtain Master of Science in Computer Science and Executive Master of Business Administration respectively. He was Certified as an Information System Auditor in 2010, by the prestigious Information System Audit and Control Association (ISACA)which is based in the United States of America. He was further certified in Risk and Information System Control by the same body in 2011. His pursuit for knowledge led him to obtain Project Management Professional certification in 2010 and SAP Associate Consultant in Materials Management in 2011.",
    "Wasiu is passionate about digital transformation, financial inclusion, elimination of friction and expansion of access, as well as opportunities, to more people and to create wealth across Africa. His notable areas of accomplishment include API and Open banking, Mobile Financial services, Agency banking, Digital lending, Digital Payments, Online payment and Collections, Cards, and Corporate Solutions.",
    "Wasiu enjoys adventure, networking and learning new things."
  ]
}
